# SQL

In [1]:
import psycopg2
import pandas as pd

In [2]:
from sqlalchemy import create_engine
%load_ext sql

## check if we can establish a connection to the umuzi database.. Method1

In [3]:
%sql postgresql://user:pass@localhost/umuzi

'Connected: user@umuzi'

In [4]:
con = psycopg2.connect(host="localhost",database="umuzi", user="user", password="pass")

## create an engine to communicate to the DB.. method2
I use SQLAlchemy in this method. This is because pandas works well with this method, in order to perform queries using pandas as it has better display capabilities.

In [5]:
engine = create_engine('postgresql://user:pass@localhost/umuzi')

### 1. Create a database called “Umuzi”.

CREATE DATABASE Umuzi

2. Create the following tables in the Umuzi database:

* Customers
* Employees
* Orders
* Payments
* Products

CREATE TABLE Customers(
CustomerID SERIAL UNIQUE,
FirstName VARCHAR(50),
LastName VARCHAR(50),
Gender VARCHAR,
Address VARCHAR(200),
Phone INT UNIQUE,
Email VARCHAR(100) UNIQUE,
City VARCHAR(20),
Country VARCHAR(50),
PRIMARY KEY (CustomerID)
);


CREATE TABLE Employees(
EmployeeID SERIAL UNIQUE,
FirstName VARCHAR(50),
LastName VARCHAR(50),
Email VARCHAR(100) UNIQUE,
JobTitle VARCHAR(20),
PRIMARY KEY (EmployeeID)
)

CREATE TABLE Orders(
OrderID SERIAL UNIQUE,
ProductID INT REFERENCES Products(ProductID),
FulfilledByEmployeeID INT REFERENCES Employees(EmployeeID),
PaymentID INT REFERENCES Payments(PaymentID),
DateRequired date,
DateShipped date,
Status VARCHAR(20),

PRIMARY KEY (OrderID, ProductID, FulfilledByEmployeeID, PaymentID)
)


CREATE TABLE Payments(
CustomerID INT REFERENCES Customer(CustomerID),
PaymentID Serial UNIQUE,
PaymentDate date,
Amount decimal,

PRIMARY KEY (PaymentID)
)

CREATE TABLE Products(
ProductID Serial UNIQUE,
ProductName VARCHAR(100),
Description VARCHAR(300),
BuyPrice DECIMAL,

PRIMARY KEY (ProductID)
)
""")

## 5. INSERT the records in the tables below into the table you created in step 2.

INSERT INTO Customers (FirstName, LastName, Gender, Address, Phone, Email, City, Country) VALUES 
('John', 'Hilbert', 'Male', '284 chaucer st', 084789657, 'john@gmail.com', 'Johannesburg', 'South Africa'),
('Thando', 'Sithole', 'Female', '240 Sect 1', 0794445584, 'thando@gmail.com', 'Cape Town', 'South Africa'),
('Leon', 'Glen', 'Male', '81 Everton Rd', 'Gillits', 0820832830, 'Leon@gmail.com', 'Durban', 'South Africa'),
('Charl	Muller', 'Male', '290A Dorset Ecke', +44856872553, 'Charl.muller@yahoo.com', 'Berlin', 'Germany'),
('Julia	Stein', 'Female', '2 Wernerring', +448672445058, 'Js234@yahoo.com', 'Frankfurt', 'Germany');

INSERT INTO EMPLOYEES(FirstName, LastName, Email, JobTitle) VALUES
('Kani', 'Matthew', 'mat@gmail.com', 'Manager'),
('Lesly', 'Cronje', 'LesC@gmail.com', 'Clerk'),
('Gideon', 'Maduku', 'm@gmail.com', 'Accountant');


INSERT INTO Orders (OrderID, ProductID, PaymentID, FulfilledByEmployeeID, DateRequired, DateShipped, Status) VALUES
(DEFAULT, 1, 1, 2, '05-09-2018', NULL, 'Not shipped'),
(DEFAULT,1,2, 2, '04-09-2018', '03-09-2018', 'Shipped'),
(DEFAULT, 3, 3, 3,'06-09-2018', NULL, 'Not shipped');

INSERT INTO PAYMENTS (
CustomerID, PaymentID, PaymentDate, Amount) VALUES
( SELECT CustomerID FROM Customers, DEFAULT, '01-09-2018', 150.75),
( SELECT CustomerID FROM Customers, DEFAULT, '03-09-2018', 150.75),
( SELECT CustomerID FROM Customers, DEFAULT, '03-09-2018', 700.60);


INSERT INTO Products (ProductName, Description, BuyPrice) VALUES
('Harley Davidson Chopper', 'This replica features working kickstand, front suspension, gear-shift lever', 150.75),
('Classic Car',  'Turnable front wheels, steering function', 550.75),
('Sports car', 'Turnable front wheels, steering function', 700.60);

# What information is stored
The database I have created is a Postgres Database which contains information about Customers, Products, Payments, Orders and Employees each seperated into its own table.

### Customers Table

Has the following fields and data types; 
* CustomerID (int)	
* FirstName (varchar50)
* LastName (varchar50)	
* Gender (varchar)	
* Address (varchar200)	
* Phone (Varchar15)	
* Email (varchar100)	
* City (varchar20)	
* Country (varchar50)
* Phone was changed to VarChar because it cant be an integer. 


###  Employees Table

Has the following fields of these data types
* EmployeeID (int)	
* FirstName (varchar50)	
* LastName (varchar50)	
* Email (varchar100)	
* JobTitle (varchar20)


### Orders Table

Has the following fields of these data types;
* OrderId (int)	
* ProductID (int)	
* PaymentID (int)	
* FulfilledByEmployeeID (int)
* DateRequired (datetime)	
* DateShipped (datetime)	
* Status (varchar20)


### Payments Table

Has the following fields of these data types;
* CustomerId (int)	
* PaymentID (int)	
* PaymentDate (datetime)	
* Amount (decimal)


### Products Table

Has the following fields of these data types:
* ProductId (int)	
* ProductName (varchar100)
* Description (varchar300)
* BuyPrice (decimal)

# Part 2 Querying the data

### 1. SELECT ALL records from table Customers.

In [6]:
cur= con.cursor()
cur.execute("""SELECT * FROM Customers""")
rows= cur.fetchall()
con.commit()

In [7]:

pd.read_sql('SELECT * FROM Customers', engine)

,customerid,firstname,lastname,gender,address,phone,email,city,country
0,3,Leon,Glen,Male,"81 Everton Rd, Gillits",820832830,Leon@gmail.com,Durban,South Africa
1,4,Charl,Muller,Male,290A Dorset Ecke,44856872553,Charl.muller@yahoo.com,Berlin,Germany
2,5,Julia,Stein,Female,2 Wernerring,448672445058,Js234@yahoo.com,Frankfurt,Germany
3,1,Lerato,Lebitso,Male,284 chaucer st,84789657,john@gmail.com,Johannesburg,South Africa

### 2. SELECT records only from the name column in the Customers table.

In [8]:
pd.read_sql('SELECT FirstName FROM Customers', engine)

  firstname
0      Leon
1     Charl
2     Julia
3    Lerato

### 3. Show the name of the Customer whose CustomerID is 1.

In [9]:
pd.read_sql('SELECT FirstName from Customers WHERE CustomerID=1;', engine)

  firstname
0    Lerato

### 4. UPDATE the record for CustomerID = 1 on the Customer table so that the name is “Lerato Mabitso”.

In [10]:
#pd.read_sql("UPDATE Customers SET FirstName='Lerato', LastName='Lebitso' WHERE CustomerID=1", engine)

cur= con.cursor()
cur.execute("UPDATE Customers SET FirstName='Lerato', LastName='Lebitso' WHERE CustomerID=1")
con.commit()
print('inserted')
cur.rowcount

inserted

1

### 5. DELETE the record from the Customers table for customer 2 (CustomerID = 2).

In [11]:
cur= con.cursor()
cur.execute('DELETE FROM Customers WHERE CustomerID=2;')
con.close()
print(f'{cur.rowcount} rows deleted')

0 rows deleted

### 6. Select all unique statuses from the Orders table and get a count of the number of orders for each unique status.

In [12]:
pd.read_sql("""SELECT Status, COUNT (Status)
FROM
   Orders
GROUP BY Status;""", engine)

        status  count
0  Not shipped      2
1      Shipped      1

### 7. Return the MAXIMUM payment made on the PAYMENTS table.

In [13]:
pd.read_sql("""SELECT MAX(Amount)
FROM Payments;""", engine)

     max
0  700.6

### 8. Select all customers from the “Customers” table, sorted by the “Country” column.

In [14]:
pd.read_sql("""SELECT * FROM Customers ORDER BY Country;""", engine)

,customerid,firstname,lastname,gender,address,phone,email,city,country
0,4,Charl,Muller,Male,290A Dorset Ecke,44856872553,Charl.muller@yahoo.com,Berlin,Germany
1,5,Julia,Stein,Female,2 Wernerring,448672445058,Js234@yahoo.com,Frankfurt,Germany
2,3,Leon,Glen,Male,"81 Everton Rd, Gillits",820832830,Leon@gmail.com,Durban,South Africa
3,1,Lerato,Lebitso,Male,284 chaucer st,84789657,john@gmail.com,Johannesburg,South Africa

### 9. Select all products with a price BETWEEN R100 and R600.

In [15]:
pd.read_sql("""SELECT * FROM Products WHERE BuyPrice BETWEEN 100 AND 600;""", engine)

,productid,productname,description,buyprice
0,1,Harley Davidson Chopper,"This replica features working kickstand, front...",150.75
1,2,Classic Car,"Turnable front wheels, steering function",550.75

### 10. Select all fields from “Customers” where country is “Germany” AND city is “Berlin”.

In [16]:
pd.read_sql("""SELECT * FROM Customers WHERE Country= 'Germany' AND City='Berlin';""", engine)

,customerid,firstname,lastname,gender,address,phone,email,city,country
0,4,Charl,Muller,Male,290A Dorset Ecke,44856872553,Charl.muller@yahoo.com,Berlin,Germany

### 11. Select all fields from “Customers” where city is “Cape Town” OR “Durban”.

In [17]:
pd.read_sql("""SELECT * FROM Customers WHERE City IN ('Cape Town', 'Durban');""", engine)

,customerid,firstname,lastname,gender,address,phone,email,city,country
0,3,Leon,Glen,Male,"81 Everton Rd, Gillits",820832830,Leon@gmail.com,Durban,South Africa

### 12. Select all records from Products where the Price is GREATER than R500.

In [18]:
pd.read_sql("""SELECT * FROM Products WHERE BuyPrice>500;""", engine)

   productid  productname                               description  buyprice
0          2  Classic Car  Turnable front wheels, steering function    550.75
1          3   Sports car  Turnable front wheels, steering function    700.60

### 13. Return the sum of the Amounts on the Payments table.

In [19]:
pd.read_sql("""SELECT SUM(Amount) FROM Payments;""", engine)

      sum
0  1002.1

### 14. Count the number of shipped orders in the Orders table.

In [20]:
pd.read_sql("""SELECT COUNT(*) FROM Orders WHERE Status='Shipped';""", engine)

   count
0      1

### 15. Return the average price of all Products, in Rands and in Dollars (assume the exchange rate is R12 to the Dollar).

In [21]:
pd.read_sql("""SELECT AVG(BuyPrice) AS Rands, AVG(BuyPrice)/12 AS Dollars FROM Products;""", engine)

        rands    dollars
0  467.366667  38.947222

### 16. Using INNER JOIN create a query that selects all Payments with Customer information.

In [22]:
pd.read_sql("""SELECT * FROM Payments INNER JOIN Customers ON Customers.CustomerID= Payments.CustomerID""", engine)

,customerid,paymentid,paymentdate,amount,customerid,firstname,lastname,gender,address,phone,email,city,country
0,1,1,2018-01-09,150.75,1,Lerato,Lebitso,Male,284 chaucer st,84789657,john@gmail.com,Johannesburg,South Africa
1,5,2,2018-03-09,150.75,5,Julia,Stein,Female,2 Wernerring,448672445058,Js234@yahoo.com,Frankfurt,Germany
2,4,3,2018-03-09,700.60,4,Charl,Muller,Male,290A Dorset Ecke,44856872553,Charl.muller@yahoo.com,Berlin,Germany

### 17. Select all products that have turnable front wheels.

pd.read_sql("""SELECT * FROM Products 
WHERE Description 
LIKE '%Turnable front wheels%' """,
            engine)

In [23]:
# create connection again as it says connection closed.
con = psycopg2.connect(host="localhost",database="umuzi", user="user", password="pass")

cur= con.cursor()
cur.execute("""SELECT * FROM Products 
WHERE Description 
LIKE '%Turnable front wheels%' """)
rows= cur.fetchall()
con.commit()

In [24]:
rows

[(2,
  'Classic Car',
  'Turnable front wheels, steering function',
  Decimal('550.75')),
 (3,
  'Sports car',
  'Turnable front wheels, steering function',
  Decimal('700.60'))]

In [26]:
#close the connection
con.close()